api_server/test/api_server_performance.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 2
      name: Steady Paced Requests
scenarios:
  # We define one scenario:
  - name: "2 Users Making Sequential Requests To Test Response Time"
    flow:
      - get:
          url: "/sources"
      - get:
          url: "/facts"
      - get:
          url: "/reports"
      - get:
          url: "/training"
      - get:
          url: "/nnmodels"